Revit 2027 API
ParameterTypeId.EdgeLinework Property
 "Line Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EdgeLinework { get; }
Public Shared ReadOnly Property EdgeLinework As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EdgeLinework {
	ForgeTypeId^ get ();
}
static member EdgeLinework : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace